Router de casa


Router>enable

Router#configure terminal

Router(config)#interface GigabitEthernet0/0
Router(config-if)#ip address 192.168.10.1 255.255.255.128
Router(config-if)#
Router(config-if)#exit
Router(config)#interface GigabitEthernet0/1
Router(config-if)#ip address 192.168.10.129 255.255.255.128
Router(config-if)#no shutdown
Router(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up
Router(config-if)#exit
Router(config)#interface GigabitEthernet0/0
Router(config-if)#no shutdown
%LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up

Router(config-if)#exit

Router(config)#ip dhcp excluded-address 192.168.10.1
Router(config)#ip dhcp excluded-address 192.168.10.129

%SYS-5-CONFIG_I: Configured from console by console

	
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#service dhcp 
Router(config)#ip dhcp pool LANPool01
Router(dhcp-config)#network 192.168.10.0 255.255.255.128
Router(dhcp-config)#defa
Router(dhcp-config)#default-router 192.168.10.1
Router(dhcp-config)#exit
Router(config)#ip dhcp pool LANPool02
Router(dhcp-config)#network 192.168.10.129 255.255.255.128
Router(dhcp-config)#default-router 192.168.10.129
Router(dhcp-config)#exit
Router(config)#
Router#
%SYS-5-CONFIG_I: Configured from console by console


Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#acc
Router(config)#access-list 1 permit 192.168.10.0 0.0.0.255


Router(config)#ip nat inside source list 1 interface serial 0/1/0 overload
Router(config)#inter
Router(config)#interface gi
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip nat ins
Router(config-if)#ip nat inside 
Router(config-if)#exit
Router(config)#int
Router(config)#interface gi
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip nat
Router(config-if)#ip nat in
Router(config-if)#ip nat inside 
Router(config-if)#exit
Router(config)#inter
Router(config)#interface se
Router(config)#interface serial 0/1/0
Router(config-if)#ip nat outside
